Catalogs/ИА_ВидыСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ВидыСтатистик</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПеревернутаяСтатистика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыАналитикиСтатистики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПолученияДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВариантыПолученияДанныхСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОтображаетСостояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтогов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИтоговЗаОдинПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ВидыИтоговЗаОдинПериод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПроизвольноеВыражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКуб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКуба</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_НомерКуба</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеАналитика3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеПериод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_СоответствиеКоличество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_ХранилищеЗапросаКонструктора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЛинии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИА_НастройкаОтбораХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабПараметровЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапросаИтоговый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйСписок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ПроверочныйСписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ПоляРасшифровки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
								<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеРегистры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регистр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатистикиФормулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ИА_УчетСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_УчетСтатистик</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ИА_ВариантыПолученияДанныхСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыПолученияДанныхСтатистик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументомСтатистика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_ВидыСтатистик/Ext/ObjectModule.bsl
Перем ТаблицаСоответствийВидовСравнений;

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка или ЭтоГруппа Тогда 
		Возврат; 
	КонецЕсли;
	
	КраткоеНаименование = СокрЛП(КраткоеНаименование);
	
	Если КраткоеНаименование <> "" ТОгда
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_ВидыСтатистик.Ссылка
		               |ИЗ
		               |	Справочник.ИА_ВидыСтатистик КАК ИА_ВидыСтатистик
		               |ГДЕ
		               |	ИА_ВидыСтатистик.КраткоеНаименование = &КраткоеНаименование
		               |	И ИА_ВидыСтатистик.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("КраткоеНаименование", КраткоеНаименование);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборк = запрос.Выполнить().Выбрать();
		
		Если Выборк.Следующий() Тогда
			Сообщить("Краткое наименование уже используется в другой статистике: "+ Выборк.ссылка);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьЗапросСтатистики(СписокПараметров) Экспорт
	Запрос = Новый Запрос;
	
	ссылкаНаВидСт = ЭтотОбъект.Ссылка;
	Если ссылкаНаВидСт.Пустая() Тогда
		ссылкаНаВидСт = ЭтотОбъект.ПолучитьСсылкуНового();
	КонецЕсли;
	Если ссылкаНаВидСт.Пустая() Тогда
		ссылкаНаВидСт = Справочники.ИА_ВидыСтатистик.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ЭтотОбъект.УстановитьСсылкуНового(ссылкаНаВидСт);
	КонецЕсли;
		
		
	Если ЭтотОбъект.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика Тогда
		Если ЭтотОбъект.ЗапросОтображаетСостояние Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ИА_УчетСтатистик.Период,
			               |	ИА_УчетСтатистик.Аналитика1,
			               |	ИА_УчетСтатистик.Аналитика2,
			               |	ИА_УчетСтатистик.Аналитика3,
			               |	ИА_УчетСтатистик.Количество
			               |ИЗ
			               |	РегистрНакопления.ИА_УчетСтатистик КАК ИА_УчетСтатистик
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			МАКСИМУМ(ИА_УчетСтатистик.Период) КАК Период
			               |		ИЗ
			               |			РегистрНакопления.ИА_УчетСтатистик КАК ИА_УчетСтатистик
			               |		ГДЕ
			               |			ИА_УчетСтатистик.ВидСтатистики = &ВидСтатистики_КОД3003ИА
			               |			И ИА_УчетСтатистик.Период МЕЖДУ &ДатаНачала И &ДатаКонца
			               |			И (&Аналитика1 = НЕОПРЕДЕЛЕНО
			               |					ИЛИ ИА_УчетСтатистик.Аналитика1 = &Аналитика1)
			               |			И (&Аналитика2 = НЕОПРЕДЕЛЕНО
			               |					ИЛИ ИА_УчетСтатистик.Аналитика2 = &Аналитика2)
			               |			И (&Аналитика3 = НЕОПРЕДЕЛЕНО
			               |					ИЛИ ИА_УчетСтатистик.Аналитика3 = &Аналитика3)) КАК ПодЗапрос
			               |		ПО ИА_УчетСтатистик.Период = ПодЗапрос.Период
			               |ГДЕ
			               |	ИА_УчетСтатистик.ВидСтатистики = &ВидСтатистики_КОД3003ИА
			               |	И (&Аналитика1 = НЕОПРЕДЕЛЕНО
			               |			ИЛИ ИА_УчетСтатистик.Аналитика1 = &Аналитика1)
			               |	И (&Аналитика2 = НЕОПРЕДЕЛЕНО
			               |			ИЛИ ИА_УчетСтатистик.Аналитика2 = &Аналитика2)
			               |	И (&Аналитика3 = НЕОПРЕДЕЛЕНО
			               |			ИЛИ ИА_УчетСтатистик.Аналитика3 = &Аналитика3)";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ИА_УчетСтатистик.Период КАК Период,
			               |	ИА_УчетСтатистик.Аналитика1 КАК Аналитика1,
			               |	ИА_УчетСтатистик.Аналитика2 КАК Аналитика2,
			               |	ИА_УчетСтатистик.Аналитика3 КАК Аналитика3,
			               |	ИА_УчетСтатистик.Количество КАК Количество
			               |ИЗ
			               |	РегистрНакопления.ИА_УчетСтатистик КАК ИА_УчетСтатистик
			               |ГДЕ
			               |	ИА_УчетСтатистик.ВидСтатистики = &ВидСтатистики_КОД3003ИА
			               |	И ИА_УчетСтатистик.Период МЕЖДУ &ДатаНачала И &ДатаКонца
			               |	И (&Аналитика1 = НЕОПРЕДЕЛЕНО
			               |			ИЛИ ИА_УчетСтатистик.Аналитика1 = &Аналитика1)
			               |	И (&Аналитика2 = НЕОПРЕДЕЛЕНО
			               |			ИЛИ ИА_УчетСтатистик.Аналитика2 = &Аналитика2)
			               |	И (&Аналитика3 = НЕОПРЕДЕЛЕНО
			               |			ИЛИ ИА_УчетСтатистик.Аналитика3 = &Аналитика3)";
			Если Родитель = Справочники.ИА_ВидыСтатистик.СтатистикиФП Тогда						   
				Запрос.Текст = Запрос.Текст + "
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ФинПоказатели.Ссылка.Дата,
			               |	ФинПоказатели.Ссылка.Организация,
			               |	НЕОПРЕДЕЛЕНО,
			               |	НЕОПРЕДЕЛЕНО,
			               |	ФинПоказатели.Значение
			               |ИЗ
			               |	Документ.ИА_ФинансовоеПланирование.ФинПоказатели КАК ФинПоказатели
			               |ГДЕ
			               |	ФинПоказатели.Показатель = &ВидСтатистики_КОД3003ИА
			               |	И ФинПоказатели.Ссылка = &ДокФП_Ссылка";
				Запрос.УстановитьПараметр("ДокФП_Ссылка", Неопределено);
			КонецЕсли;
		КонецЕсли;				  
		Запрос.УстановитьПараметр("ВидСтатистики_КОД3003ИА", ссылкаНаВидСт);
	ИначеЕсли ЭтотОбъект.ИспользоватьКуб Тогда  // запросом, куб
		Запрос.Текст = "ВЫБРАТЬ  
				       |	ИА_УчетСтатистик.Период,
		               |	ИА_УчетСтатистик.Аналитика1,
					   |	ИА_УчетСтатистик.Аналитика2,
		               |	ИА_УчетСтатистик.Аналитика3,
		               |	ИА_УчетСтатистик.Количество
				       |ИЗ
				       |	РегистрНакопления.ИА_" + ЭтотОбъект.НомерКуба +" КАК ИА_УчетСтатистик
				       |ГДЕ
				       |	ИА_УчетСтатистик.Период МЕЖДУ &ДатаНачала И &ДатаКонца
					   |	И ИА_УчетСтатистик.ВидСтатистики = &ВидСтатистики_КОД3003ИА";
		Запрос.УстановитьПараметр("ВидСтатистики_КОД3003ИА", ссылкаНаВидСт);
	ИначеЕсли ЭтотОбъект.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.ИзЗапроса Тогда
		Запрос.Текст = ЭтотОбъект.ТекстЗапроса;
		Попытка
			Запрос.Текст = ИА_Защита_Статистика.ДобавитьОтборыПериодаВЗапрос(ЭтотОбъект.ТекстЗапроса);
		Исключение   // при использовании времнных таблиц будет исключение
		КонецПопытки;
		
		Для каждого стр из СписокПараметров Цикл
			Запрос.УстановитьПараметр(стр.ИмяПараметра, стр.Значение);
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.ВариантПолученияДанных = Перечисления.ИА_ВариантыПолученияДанныхСтатистик.Конструктором Тогда
		
		источник = ЭтотОбъект.ИА_Источник;
		ЭтоВиртТаблица = Ложь;
				
		Если Найти(ЭтотОбъект.ИА_Источник, ".Остатки") <> 0  Тогда
			источник = источник + "(ДобавитьКДате(&ДатаКонца , СЕКУНДА , 1),<УсловияВТ>)";
			ЭтоВиртТаблица = истина;
		ИначеЕсли Найти(ЭтотОбъект.ИА_Источник, ".СрезПервых") <> 0 
			Или Найти(ЭтотОбъект.ИА_Источник, ".СрезПоследних") <> 0 Тогда
			источник = источник + "(&ДатаКонца ,<УсловияВТ>)";
			ЭтоВиртТаблица = истина;
		ИначеЕсли Найти(ЭтотОбъект.ИА_Источник, ".Обороты") <> 0  Тогда
			источник = источник + "(&ДатаНачала,&ДатаКонца,Регистратор,<УсловияВТ>)";
			ЭтоВиртТаблица = истина;
		ИначеЕсли Найти(ЭтотОбъект.Иа_Источник, ".ДвиженияССубконто") <> 0 Тогда
			источник = источник + "(&ДатаНачала,&ДатаКонца,<УсловияВТ>)";
			ЭтоВиртТаблица = истина;
		КонецЕсли;	
		
		
		ТекстЗапросаКонструктора = "ВЫБРАТЬ РАЗРЕШЕННЫЕ <Период> КАК Период,
							|<Аналитика1> КАК Аналитика1,
							|<Аналитика2> КАК Аналитика2,
							|<Аналитика3> КАК Аналитика3,
							|<Количество> КАК Количество
							|ИЗ <ИсточникДанных> КАК Источник"; 
							
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Аналитика1>", ?(ЭтотОбъект.ИА_СоответствиеАналитика1="","НЕОПРЕДЕЛЕНО","Источник."+ЭтотОбъект.ИА_СоответствиеАналитика1)); 
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Аналитика2>", ?(ЭтотОбъект.ИА_СоответствиеАналитика2="","НЕОПРЕДЕЛЕНО","Источник."+ЭтотОбъект.ИА_СоответствиеАналитика2)); 
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Аналитика3>", ?(ЭтотОбъект.ИА_СоответствиеАналитика3="","НЕОПРЕДЕЛЕНО","Источник."+ЭтотОбъект.ИА_СоответствиеАналитика3)); 
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Период>", ?(ЭтотОбъект.ИА_СоответствиеПериод="&ДатаКонца","&ДатаКонца","Источник."+ЭтотОбъект.ИА_СоответствиеПериод)); 		
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<Количество>", ?(ЭтотОбъект.ИА_СоответствиеКоличество = "1", "1","Источник."+ЭтотОбъект.ИА_СоответствиеКоличество));
		ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора, "<ИсточникДанных>", источник);
		
		//Формируем таблицу условий					
		
		тзОтборов = ПолучитьТаблицуОтборов();
		
		Если ЭтоВиртТаблица Тогда
			Измерения = ИА_Защита_Статистика.ПолучитьСписокИзмерений(ЭтотОбъект.ИА_Источник);
			УсловиеИзмерения = "";
			ОбычноеУсловие = "";
			
			Для каждого стр из тзОтборов Цикл
				ТекстУсловия = ФормируемУсловие(стр, Запрос);
				Если Измерения.Найти(Строка(стр.ЛевоеЗначение)) = Неопределено Тогда
					Если ОбычноеУсловие = "" Тогда
						ОбычноеУсловие = ТекстУсловия;
					Иначе
						ОбычноеУсловие = ОбычноеУсловие + " И Источник." + ТекстУсловия;
					КонецЕсли;
				Иначе
					Если УсловиеИзмерения = "" Тогда
						УсловиеИзмерения = ТекстУсловия;
					Иначе
						УсловиеИзмерения = УсловиеИзмерения + " И " + ТекстУсловия;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ТекстЗапросаКонструктора = СтрЗаменить(ТекстЗапросаКонструктора,"<УсловияВТ>",УсловиеИзмерения);
			Если ОбычноеУсловие<>"" Тогда
				ТекстЗапросаКонструктора = ТекстЗапросаКонструктора + " ГДЕ " + ОбычноеУсловие;
			КонецЕсли;
		Иначе
			ОбычноеУсловие = "";
			Для каждого стр из тзОтборов Цикл
				ТекстУсловия = ФормируемУсловие(стр, Запрос);
				ОбычноеУсловие = ОбычноеУсловие + " И Источник." + ТекстУсловия;
			КонецЦикла;
			ТекстЗапросаКонструктора = ИА_Защита_Статистика.ДобавитьОтборыПериодаВЗапрос(ТекстЗапросаКонструктора);
			ТекстЗапросаКонструктора = ТекстЗапросаКонструктора + ОбычноеУсловие;
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапросаКонструктора;
	КонецЕсли;
	
	Возврат Запрос;

КонецФункции


Функция ПолучитьТаблицуОтборов()
	тзОтборы = Новый ТаблицаЗначений;
	тзОтборы.Колонки.Добавить("ИмяПараметра");
	тзОтборы.Колонки.Добавить("ЛевоеЗначение");
	тзОтборы.Колонки.Добавить("ВидСравнения");
	тзОтборы.Колонки.Добавить("ПравоеЗначение");
	
	НастройкаОтбора = ЭтотОбъект.ИА_НастройкаОтбораХранилище.Получить();
	Если НастройкаОтбора = Неопределено Тогда
		возврат тзОтборы;
	КонецЕсли;
	
	НаборНастроек = НастройкаОтбора.Отбор.Элементы;
	
	сч=50;
	Для каждого с из НаборНастроек Цикл
		Если Не с.Использование Тогда 
			Продолжить 
		КонецЕсли;
		
		НовыйОтбор = тзОтборы.Добавить();
		НовыйОтбор.ЛевоеЗначение = с.ЛевоеЗначение;
		НовыйОтбор.ВидСравнения = с.ВидСравнения;
		Если с.ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС
			Или с.ВидСравнения = ВидСравненияКомпоновкиДанных.НеНачинаетсяС Тогда
			с.ПравоеЗначение = с.ПравоеЗначение + "%";
		ИначеЕсли с.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит 
			Или с.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
			с.ПравоеЗначение = "%" + с.ПравоеЗначение + "%";
		КонецЕсли;	
		НовыйОтбор.ПравоеЗначение = с.ПравоеЗначение;
		НовыйОтбор.ИмяПараметра = "Параметр"+сч;
		
		сч = сч + 1;
	КонецЦикла;
	
	Возврат тзОтборы;
	
КонецФункции // ПолучитьТаблицуОтборов()

Функция ФормируемУсловие(стр, Запрос)
	ИмяПараметра = стр.ИмяПараметра;
	ЛевоеЗначение = стр.ЛевоеЗначение;
	ПравоеЗначение = стр.ПравоеЗначение;
	ВидСравненияЗн = стр.ВидСравнения;	
	Условие = "";
	
	Если ВидСравнения <> ВидСравненияКомпоновкиДанных.НеЗаполнено 
		И ВидСравнения <> ВидСравненияКомпоновкиДанных.Заполнено Тогда
		Условие = Строка(ЛевоеЗначение) + ТаблицаСоответствийВидовСравнений.Получить(ВидСравненияЗн);
		Условие = СтрЗаменить(Условие, "<ИмяПараметра>", ИмяПараметра);
		Запрос.УстановитьПараметр(ИмяПараметра, ПравоеЗначение);
	Иначе
		Условие = Строка(ЛевоеЗначение) + ТаблицаСоответствийВидовСравнений.Получить(ВидСравненияЗн);
	КонецЕсли;
	
	Возврат Условие;
	
КонецФункции

ТаблицаСоответствийВидовСравнений = Новый Соответствие;
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Равно,	 			" = &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Больше, 			" > &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно, 	" >= &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Меньше, 			" < &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, 	" <= &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеРавно, 			" <> &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВИерархии, 			" В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, 	" В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.ВСписке, 			" В(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеВСписке, 			" Не В(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеВИерархии, 		" Не В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии," Не В Иерархии(&<ИмяПараметра>) ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Подобно, 			" Подобно &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеПодобно, 			" Не Подобно &<ИмяПараметра> ");
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Заполнено, 			" <> Неопределено "); 
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеЗаполнено, 		" = Неопределено ");   
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НачинаетсяС, 		" Подобно &<ИмяПараметра> ");   
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеНачинаетсяС, 		" Не Подобно &<ИмяПараметра> ");  
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.Содержит, 			" Подобно &<ИмяПараметра> ");   
ТаблицаСоответствийВидовСравнений.Вставить(ВидСравненияКомпоновкиДанных.НеСодержит, 		" Не Подобно &<ИмяПараметра> ");
